{"count":201,"next":null,"previous":"https://summerofcode.withgoogle.com/api/program/current/organization/?page=2&page_size=100","results":[{"id":6508216277008384,"name":"Zulip","slug":"zulip","website_url":"https://zulip.org/","category":"social_communications","contact_email":null,"mailing_list":"https://groups.google.com/forum/#!forum/zulip-gsoc","irc_channel":"https://chat.zulip.org/","tagline":"Server, web app & mobile apps making group chat easy for teams","precis":"Zulip is a powerful group chat application. The server is written in Python with Django; you could also work on cross-platform mobile and desktop apps, or our many integrations.","description":"[Zulip](https://www.zulip.org) is a powerful, open source group chat\napplication. The core web app is written in Python and uses the Django\nframework. We also make a React Native iOS app, an Android app, a\ncross-platform Electron desktop app, and many service integrations, all open\nsource.\n\nZulip supports both private messaging and group chats via conversation\nstreams. Zulip also supports fast search, drag-and-drop file uploads,\nimage previews, group private messages, audible notifications,\nmissed-message emails, desktop apps, and [much\nmore](https://www.zulip.org).\n\nZulip has gained a considerable amount of traction [since Dropbox released\nit as open source software in September\n2015](https://blogs.dropbox.com/tech/2015/09/open-sourcing-zulip-a-dropbox-hack-week-project/),\nand is gaining more users at a rapid pace -- every day, at least tens\nof thousands of people use Zulip. Your work on Zulip will have impact\non the daily experiences of a huge number of people.\n\nAs an organization, we value high-quality mentorship and making sure our product quality is extremely high -- you can expect to learn a lot how to make a large software project successful from disciplined code reviews by highly experienced engineers. Since Zulip is a group chat product, your GSoC experience with the Zulip project will be highly interactive (often collaborating with developers over chat to solve tricky problems), with a real focus on teaching you the concepts and reasoning behind how Zulip is engineered and how to make it better.","tags":[],"primary_open_source_license":"Apache License 2.0 (Apache-2.0)","image_url":"//lh3.googleusercontent.com/4QMZsEPNQGKdGyU35C4SdDK6FeyuTwdeErPxqrt1E3WTja3Q0pTmMVp0fTYfaZpSwATBhoVSQXUYzbJ9MgI-5fMIq7mHMxg","image_bg_color":"7e98ad","gplus_url":null,"twitter_url":"http://twitter.com/zuliposs","blog_url":"https://blog.zulip.org/","application_instructions":"We have application instructions at [our ideas page](https://github.com/zulip/zulip.github.io/blob/master/gsoc-ideas.md#application-tips-and-how-to-be-a-strong-candidate), along with tips on how to be a strong candidate.\n\nThe best applicants are those who take an ownership mentality with the part of the project that they're working on: finding and reporting bugs, reviewing others' code, carefully testing their work when they fix issues to ensure they don't cause other problems, carefully explaining their changes with clear variable names, comments, and commit messages, and helping other contributors with their work, just like the maintainer of an open source project would.","topic_tags":["enterprise","web development","group chat","cross-platform","mobile applications"],"technology_tags":["python","django","javascript","react native","android"],"proposal_tags":["mobile","django","performance","mypy","integration","automated testing","apis","desktop","python","web application"],"ideas_list":"https://github.com/zulip/zulip.github.io/blob/master/gsoc-ideas.md","contact_method":"https://chat.zulip.org/","program_year":2017}]}